[Killed] BlockStatement
5º Semestre/Gerenciamento de Processo de Software/teste-mutacao/calc.js:1:23
-const sum = (a, b) => {
-    return a + b
-}
+const sum = (a, b) => {}
 
 const sub = (a, b) => {
killedBy: sums 2 numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ArithmeticOperator
5º Semestre/Gerenciamento de Processo de Software/teste-mutacao/calc.js:2:12
 const sum = (a, b) => {
-    return a + b
+    return a - b
 }
 
killedBy: sums 2 numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: -1

[Killed] BlockStatement
5º Semestre/Gerenciamento de Processo de Software/teste-mutacao/calc.js:5:23
     return a + b
 }
 
-const sub = (a, b) => {
-    return a - b
-}
+const sub = (a, b) => {}
 
 const mult = (a, b) => {
killedBy: subs 2 numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ArithmeticOperator
5º Semestre/Gerenciamento de Processo de Software/teste-mutacao/calc.js:6:12
 }
 
 const sub = (a, b) => {
-    return a - b
+    return a + b
 }
 
killedBy: subs 2 numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 3

[Killed] BlockStatement
5º Semestre/Gerenciamento de Processo de Software/teste-mutacao/calc.js:9:24
     return a - b
 }
 
-const mult = (a, b) => {
-    return a * b
-}
+const mult = (a, b) => {}
 
 const div = (a, b) => {
killedBy: mults 2 numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: undefined

[Killed] ArithmeticOperator
5º Semestre/Gerenciamento de Processo de Software/teste-mutacao/calc.js:10:12
 }
 
 const mult = (a, b) => {
-    return a * b
+    return a / b
 }
 
killedBy: mults 2 numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 1

[Killed] BlockStatement
5º Semestre/Gerenciamento de Processo de Software/teste-mutacao/calc.js:13:23
     return a * b
 }
 
-const div = (a, b) => {
-    return a / b
-}
+const div = (a, b) => {}
 
 module.exports = { sum, sub, mult, div }
killedBy: divs 2 numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ArithmeticOperator
5º Semestre/Gerenciamento de Processo de Software/teste-mutacao/calc.js:14:12
 }
 
 const div = (a, b) => {
-    return a / b
+    return a * b
 }
 
killedBy: divs 2 numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: Infinity
Received: 0
